TestCC/MP0001.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Header><gateway:HeadType xmlns:gateway="http://www.agree.com.cn/GDBGateway" soapenv:actor="" soapenv:mustUnderstand="0"><gateway:versionNo>1</gateway:versionNo><gateway:toEncrypt>0</gateway:toEncrypt><gateway:commCode>500001</gateway:commCode><gateway:commType>0</gateway:commType><gateway:receiverId>CMMS</gateway:receiverId><gateway:senderId>IBS</gateway:senderId><gateway:senderSN>20140328700016041844</gateway:senderSN><gateway:senderDate>20140328</gateway:senderDate><gateway:senderTime>174621</gateway:senderTime><gateway:tradeCode>CMM001</gateway:tradeCode></gateway:HeadType></soapenv:Header><soapenv:Body><gateway:NoAS400 xmlns:gateway="http://www.agree.com.cn/GDBGateway"><gateway:field name="CUST_ID">137001</gateway:field><gateway:field name="BANK_ID">01</gateway:field><gateway:field name="OFFER_END_DATE_START">20120101</gateway:field><gateway:field name="OFFER_END_DATE_END">20130909</gateway:field><gateway:field name="NextPageId">1</gateway:field></gateway:NoAS400></soapenv:Body></soapenv:Envelope>